In [33]:
import pandas as pd

In [34]:
med_age = pd.read_excel("AGE01.xls", "Sheet2")

In [35]:
print(med_age.shape)
med_age.columns

(3198, 42)

Index(['Areaname', 'STCOU', 'AGE040205F', 'AGE040205D', 'AGE040205N1',
       'AGE040205N2', 'AGE040206F', 'AGE040206D', 'AGE040206N1', 'AGE040206N2',
       'AGE040207F', 'AGE040207D', 'AGE040207N1', 'AGE040207N2', 'AGE040208F',
       'AGE040208D', 'AGE040208N1', 'AGE040208N2', 'AGE040209F', 'AGE040209D',
       'AGE040209N1', 'AGE040209N2', 'AGE050180F', 'AGE050180D', 'AGE050180N1',
       'AGE050180N2', 'AGE050190F', 'AGE050190D', 'AGE050190N1', 'AGE050190N2',
       'AGE050200F', 'AGE050200D', 'AGE050200N1', 'AGE050200N2', 'AGE050210F',
       'AGE050210D', 'AGE050210N1', 'AGE050210N2', 'AGE110180F', 'AGE110180D',
       'AGE110180N1', 'AGE110180N2'],
      dtype='object')

In [36]:
##Column descriptions

#### Areaname: County name
#### STCOU: GEOID
#### AGE050180D: Resident population: Median age (complete count) 1980
#### AGE050190D: Resident population: Median age (complete count) 1990
#### AGE050200D: Resident population: Median age (April 1 - complete count) 2000
#### AGE050210D: Resident population: Median age (April 1 - complete count) 2010

cols_drop = ['AGE040205F', 'AGE040205D', 'AGE040205N1',
       'AGE040205N2', 'AGE040206F', 'AGE040206D', 'AGE040206N1', 'AGE040206N2',
       'AGE040207F', 'AGE040207D', 'AGE040207N1', 'AGE040207N2', 'AGE040208F',
       'AGE040208D', 'AGE040208N1', 'AGE040208N2', 'AGE040209F', 'AGE040209D',
       'AGE040209N1', 'AGE040209N2', 'AGE050180F', 'AGE050180N1',
       'AGE050180N2', 'AGE050190F', 'AGE050190N1', 'AGE050190N2',
       'AGE050200F', 'AGE050200N1', 'AGE050200N2', 'AGE050210F',
       'AGE050210N1', 'AGE050210N2', 'AGE110180F', 'AGE110180D',
       'AGE110180N1', 'AGE110180N2']

med_age = med_age.drop(columns = cols_drop, axis = 1) 
print(med_age.shape)
med_age.head(5)

(3198, 6)

        Areaname  STCOU  AGE050180D  AGE050190D  AGE050200D  AGE050210D
0  UNITED STATES      0        30.0        32.9        35.3        37.2
1        ALABAMA   1000        29.3        33.0        35.8        37.9
2    Autauga, AL   1001        27.9        31.7        35.1        37.0
3    Baldwin, AL   1003        30.6        35.5        39.0        41.1
4    Barbour, AL   1005        30.1        32.8        35.8        39.0

In [37]:
age = pd.DataFrame()
col_list = ['AGE050180D','AGE050190D','AGE050200D','AGE050210D']

for item in col_list:
    
    if item[-3] == '8':
        year = 1980
    elif item[-3] == '9': 
        year = 1990
    elif item[-3] == '0': 
        year = 2000
    else:
        year = 2010
    
    temp_df = med_age[['Areaname', 'STCOU']]
    temp_df.insert(0, 'YEAR', year)
    temp_df.insert(3, 'Median_Age', med_age[item])
    
    age = age.append(temp_df, ignore_index=True)

In [38]:
print(age.YEAR.unique())
age

[1980 1990 2000 2010]

       YEAR        Areaname  STCOU  Median_Age
0      1980   UNITED STATES      0        30.0
1      1980         ALABAMA   1000        29.3
2      1980     Autauga, AL   1001        27.9
3      1980     Baldwin, AL   1003        30.6
4      1980     Barbour, AL   1005        30.1
...     ...             ...    ...         ...
12787  2010  Sweetwater, WY  56037        32.8
12788  2010       Teton, WY  56039        36.9
12789  2010       Uinta, WY  56041        33.9
12790  2010    Washakie, WY  56043        41.8
12791  2010      Weston, WY  56045        42.3

[12792 rows x 4 columns]

In [39]:
age.to_csv('age.csv', index=False)